#! /usr/bin/env python
# -*- coding: utf-8 -*-
# __author__ = "Q1mi"

city_dict = {
    "北京": {
        "西城区": ["广安门", "新街口", "什刹海"],
        "东城区": ["安定门", "朝阳门", "前门"],
        "朝阳区": ["国贸", "三里屯", "首都机场"],
        "海淀区": ["五道口", "学院路", "中关村"],
        "丰台区": ["卢沟桥", "方庄", "大红门"],
        "石景山区": ["八宝山", "老山", "八角"],
        "通州区": ["永顺镇", "梨园镇", "宋庄镇"],
        "顺义区": ["空港街道", "光明街道", "胜利街道"],
        "房山区": ["城关街道", "东风街道", "向阳街道"],
        "大兴区": ["亦庄", "黄村镇", "西红门"],
        "昌平区": ["昌平镇", "兴寿镇", "沙河镇"],
        "怀柔区": ["怀柔镇", "雁栖镇", "北房镇"],
        "平谷区": ["兴谷街道", "滨河街道", "平谷镇"],
        "门头沟区": ["大峪街道", "城子街道", "东辛房街道"],
        "密云区": ["密云镇", "十里堡镇", "果园街道"],
        "延庆区": ["百泉街道", "香水园街道", "儒林街道"]
        },
    "上海": {
        "": [],
        "": [],
        "": [],
        "": []
        },
    "香港": {
        "": [],
        "": [],
        "": [],
        "": []
    }
}
print("Hello! Please input 's' to start!")
print(city_dict["北京"]["西城区"])
print(city_dict["北京"]["西城区"][0])
num = 1
for item in city_dict.get("北京"):
    print("%s. %s" % (num, item))
    print(city_dict["北京"][item])
    num += 1
