#! /usr/bin/env python
# -*- coding: utf-8 -*-
# __author__ = "Q1mi"

"""
计算器开发
-1.实现加减乘除及括号优先级解析
-2.用户输入 1 - 2 * ( (60-30 +(-40/5) * (9-2*5/3 + 7 /3*99/4*2998 +10 * 568/14 )) - (-4*3)/ (16-3*2) )等类似公式后，
-  必须自己解析里面的(),+,-,*,/符号和公式，运算后得出结果，结果必须与真实的计算器所得出的结果一致
"""
import re

s = "1 - 2 * ( (60-30 +(-40/5) * (9-2*5/3 + 7 /3*99/4*2998 +10 * 568/14 )) - (-4*3)/ (16-3*2) )"
# 找到最里面的括号
result = re.search(r'\([^\(\)]+\)', s)
if result:
	print(result.group())
	# 去除运算符和括号，得到数字的列表
	n = re.split(r'[\+\-\*\/]', result.group().strip('\(\)'))
	print(n)
	# 去除数字和括号，得到运算符的列表
	m = re.split(r'\d+', result.group().strip('\(\)'))
	print(m)
# 将字符串的前面和后面放进列表，把匹配到的字符串算出数值之后再传进去
result2 = s.split(result.group())
print(result2)
